Tekla.Structures.Internal.dotIdentifierToGUID_t


Tekla.Structures.Internal.dotIdentifierToGUID_t.legacyGuidPrefix


Tekla.Structures.Internal.dotIdentifierToGUID_t.Identifier


Tekla.Structures.Internal.dotIdentifierToGUID_t.GUID


Tekla.Structures.Internal.dotIdentifierToGUID_t.GetIdentifierByGuid(System.String)
Returns an identifier instance that has the given GUID in the model.
guid: The GUID to look for in the model.
Returns: The identifier of the GUID, with empty values if not found.

Tekla.Structures.Internal.dotIdentifierToGUID_t.GetGuidByIdentifier(Tekla.Structures.Identifier)
Returns the GUID of the given identifier instance.
Returns: The GUID of the identifier.